# IdeaStatiCa.ConnectionApi.Model.ConCrossSectionParametricDefinition

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**ShapeType** | **string** |  |
**MaterialName** | **string** |  | [optional]
**Dimensions** | **List&lt;ConCrossSectionParametricDefinitionDimensionsInner&gt;** |  | [optional]
**Type** | **string** |  | [default to "IdeaStatiCa.Api.Connection.Model.Material.ConCrossSectionParametricDefinition, IdeaStatiCa.Api"]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)